lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
      return {};
    }


#endif



    void release(int spi_host)
    {
//ESP_LOGI("LGFX","spi::release");
      if (spi_host < 0)
      {
        soft_spi_release(spi_host);
        return;
      }
#if defined (ARDUINO) && __has_include (<SPI.h>) // Arduino ESP32
      if (_spi_handle[spi_host] != nullptr)
      {
        if (spi_host == default_spi_host)
        {
          SPI.end();
        }
        else
        {
          spiStopBus(_spi_handle[spi_host]);
        }
        _spi_handle[spi_host] = nullptr;
      }
#endif
      if (_spi_dev_handle[spi_host] != nullptr)
      {
        spi_bus_remove_device(_spi_dev_handle[spi_host]);
        spi_bus_free(static_cast<spi_host_device_t>(spi_host));
        _spi_dev_handle[spi_host] = nullptr;
      }
    }

    void beginTransaction(int spi_host)
    {
      if (spi_host < 0)
      {
        soft_spi_beginTransaction(spi_host);
        return;
      }
#if defined (ARDUINO) // Arduino ESP32
      spiSimpleTransaction(_spi_handle[spi_host]);
#else // ESP-IDF
      if (_spi_dev_handle[spi_host]) {
        if (ESP_OK != spi_device_acquire_bus(_spi_dev_handle[spi_host], portMAX_DELAY)) {
          ESP_LOGW("LGFX", "Failed to spi_device_acquire_bus. ");
        }
#if defined ( SOC_GDMA_SUPPORTED )
        writereg(SPI_DMA_CONF_REG((spi_host + 1)), 0); /// Clear previous transfer
#endif
      }
#endif
    }

    void beginTransaction(int spi_host, uint32_t freq, int spi_mode)
    {
      if (spi_host < 0)
      {
        soft_spi_beginTransaction(spi_host, freq, spi_mode);
        return;
      }
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      uint32_t clkdiv = FreqToClockDiv(getApbFrequency(), freq);

      uint32_t user = SPI_USR_MOSI | SPI_USR_MISO | SPI_DOUTDIN;
      if (spi_mode == 1 || spi_mode == 2) user |= SPI_CK_OUT_EDGE;
      uint32_t pin = (spi_mode & 2) ? SPI_CK_IDLE_EDGE : 0;
      pin = pin
#if defined ( SPI_CS0_DIS )
            | SPI_CS0_DIS
#endif
#if defined ( SPI_CS1_DIS )
            | SPI_CS1_DIS
#endif
#if defined ( SPI_CS2_DIS )
            | SPI_CS2_DIS
#endif
#if defined ( SPI_CS3_DIS )
            | SPI_CS3_DIS
#endif
#if defined ( SPI_CS4_DIS )
            | SPI_CS4_DIS
#endif
#if defined ( SPI_CS5_DIS )
            | SPI_CS5_DIS
#endif
      ;

      beginTransaction(spi_host);

      writereg(SPI_USER_REG(spi_port), user);
#if defined (SPI_PIN_REG)
      writereg(SPI_PIN_REG(spi_port), pin);
#else
      writereg(SPI_MISC_REG( spi_port), pin);
#endif
      writereg(SPI_CLOCK_REG(spi_port), clkdiv);

#if defined ( SPI_UPDATE )
      writereg(SPI_CMD_REG(spi_port), SPI_UPDATE);
#endif
    }

    void endTransaction(int spi_host)
    {
      if (spi_host < 0) { return; }  // a software host holds nothing to release
      if (_spi_dev_handle[spi_host]) {
#if defined (ARDUINO) // Arduino ESP32
        spiEndTransaction(_spi_handle[spi_host]);
#else // ESP-IDF
        spi_device_release_bus(_spi_dev_handle[spi_host]);
#endif
      }
    }

    void endTransaction(int spi_host, int spi_cs)
    {
      endTransaction(spi_host);
      gpio_hi(spi_cs);
    }

    void writeBytes(int spi_host, const uint8_t* data, size_t len)
    {
      if (spi_host < 0)
      {
        soft_spi_writeBytes(spi_host, data, len);
        return;
      }
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);
    }

    void readBytes(int spi_host, uint8_t* data, size_t len)
    {
      if (spi_host < 0)
      {
        soft_spi_readBytes(spi_host, data, len);
        return;
      }
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);

      memcpy(data, reinterpret_cast<const void*>(SPI_W0_REG(spi_port)), len);
    }
  }

//----------------------------------------------------------------------------
  static constexpr const int __DECLARE_RCC_ATOMIC_ENV = 0;

  namespace i2c
  {
#if __has_include( <core_version.h> )
  #include <core_version.h>
#endif

#if !defined ( I2C_ACK_ERR_INT_RAW_M )
 #define I2C_ACK_ERR_INT_RAW_M I2C_NACK_INT_RAW_M
#endif

// From the ESP32-C6 on, some chips carry a low power I2C in addition to the normal ones,
// and SOC_I2C_NUM counts both of them. SOC_HP_I2C_NUM / SOC_LP_I2C_NUM tell them apart,
// but they only exist in recent ESP-IDF, so the chips with a single high power port have
// to be named when they are missing.
#if defined ( SOC_HP_I2C_NUM )
 #define LGFX_HP_I2C_NUM SOC_HP_I2C_NUM
#elif defined ( CONFIG_IDF_TARGET_ESP32C2 ) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 )
 #define LGFX_HP_I2C_NUM 1
#else
 #define LGFX_HP_I2C_NUM SOC_I2C_NUM
#endif

// ESP-IDF numbers the low power ports after all the high power ones, so the first low
// power port index is the number of high power ports. ( see i2c_port_t in hal/i2c_types.h )
//
// Bringing a low power port up is left to the ESP-IDF driver: there is no TwoWire for it,
// and the pads reach the peripheral differently depending on the chip ( a fixed LP IO MUX
// function on some, the LP GPIO matrix on others ). The driver already knows which, so it
// is asked to open the bus and the registers are taken over afterwards, exactly as this
// code does for the normal ports.
#if defined ( SOC_LP_I2C_NUM ) && ( SOC_LP_I2C_NUM > 0 ) && __has_include ( <driver/i2c_master.h> ) \
 && defined ( ESP_IDF_VERSION_VAL ) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
 #define LGFX_LP_I2C_NUM SOC_LP_I2C_NUM
 #define LGFX_LP_I2C_PORT LGFX_HP_I2C_NUM
 // The default source is the RC oscillator, which drifts with temperature. XTAL_D2 is a
 // divided crystal, so the SCL frequency comes out as asked.
 #define LGFX_LP_I2C_SCLK LP_I2C_SCLK_XTAL_D2
 #include <esp_clk_tree.h>
#else
 #define LGFX_LP_I2C_NUM 0
#endif

